src/DataProcessors/кфкКонструкторAsyncAPI/кфкКонструкторAsyncAPI.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>кфкКонструкторAsyncAPI</name>
</mdclass:DataProcessor>

src/Documents/кфкВерсияСпецификации/кфкВерсияСпецификации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>кфкВерсияСпецификации</name>
  <registerRecords>InformationRegister.кфкВерсииСпецификации</registerRecords>
  <attributes>
    <name>Спецификация</name>
    <type>
      <types>CatalogRef.кфкСпецификации</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнаяВерсия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДополняющаяВерсия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияИсправления</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВерсииОбъектов</name>
    <attributes>
      <name>Объект</name>
      <type>
        <types>DefinedType.кфкКомпонентСпецификации</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерВерсии</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Catalogs/кфкТипыДанныхСпецификации/кфкТипыДанныхСпецификации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>кфкТипыДанныхСпецификации</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <owners>Catalog.кфкСпецификации</owners>
  <attributes>
    <name>Описание</name>
    <comment>description</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипДанных</name>
    <comment>type</comment>
    <type>
      <types>CatalogRef.кфкТипыЗначенийСпецификации</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматДанных</name>
    <comment>format</comment>
    <type>
      <types>CatalogRef.кфкТипыЗначенийСпецификации</types>
    </type>
  </attributes>
  <attributes>
    <name>Минимум</name>
    <comment>minimum|minLength|minItems</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>31</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Максимум</name>
    <comment>maximum|maxLength|maxItems</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>31</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Перечисление</name>
    <comment>enum</comment>
    <type>
      <types>CatalogRef.кфкПеречисленияСпецификации</types>
    </type>
  </attributes>
  <attributes>
    <name>РегулярноеВыражение</name>
    <comment>pattern</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Устарело</name>
    <comment>deprecated</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Обязательное</name>
    <comment>required</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеПоУмолчанию</name>
    <comment>default</comment>
    <type>
      <types>Boolean</types>
      <types>String</types>
      <types>Date</types>
      <types>Number</types>
      <numberQualifiers>
        <precision>31</precision>
        <scale>4</scale>
      </numberQualifiers>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектКонфигурации</name>
    <type>
      <types>CatalogRef.Свойства</types>
      <types>CatalogRef.Объекты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>БазовыеТипы</name>
    <comment>$ref|allOf</comment>
    <attributes>
      <name>Тип</name>
      <type>
        <types>CatalogRef.кфкТипыДанныхСпецификации</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/кфкТипыЗначенийСпецификации/кфкТипыЗначенийСпецификации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>кфкТипыЗначенийСпецификации</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Строка</name>
      <description>Строка</description>
    </items>
    <items>
      <name>Число</name>
      <description>Число</description>
    </items>
    <items>
      <name>ЦелоеЧисло</name>
      <description>Целое число</description>
    </items>
    <items>
      <name>Логический</name>
      <description>Логический</description>
    </items>
    <items>
      <name>Массив</name>
      <description>Массив</description>
    </items>
    <items>
      <name>Структура</name>
      <description>Структура</description>
    </items>
  </predefined>
</mdclass:Catalog>

src/DataProcessors/кфкКонструкторAsyncAPI/ManagerModule.bsl
//@skip-check reading-attribute-from-database
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает результат формирования спецификации
// 
// Параметры:
//	ВерсияСпецификации - ДокументСсылка.кфкВерсияСпецификации - Версия спецификации
// 
// Возвращаемое значение:
//	Структура - Результат формирования спецификации:
//	* ИмяФайла - Строка - Имя файла
//	* ДанныеФайла - ДвоичныеДанные - Двоичные данные
//
Функция СформироватьAsyncAPI(ВерсияСпецификации) Экспорт
	
	// Результат
	ТДок = Новый ТекстовыйДокумент;
	
	// ПОДГОТОВКА ДАННЫХ
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Т.ОсновнаяВерсия КАК ОсновнаяВерсия,
		|	Т.ДополняющаяВерсия КАК ДополняющаяВерсия,
		|	Т.ВерсияИсправления КАК ВерсияИсправления,
		|	Т.Дата КАК Дата,
		|	Т.Автор КАК Автор,
		|	ПРЕДСТАВЛЕНИЕ(Т.Автор) КАК АвторПредставление
		|ИЗ
		|	Документ.кфкВерсияСпецификации КАК Т
		|ГДЕ
		|	Т.Ссылка = &Ссылка
		|	И Т.Проведен = ИСТИНА
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Т.Объект КАК Объект,
		|	Т.НомерВерсии КАК НомерВерсии
		|ИЗ
		|	Документ.кфкВерсияСпецификации.ВерсииОбъектов КАК Т
		|ГДЕ
		|	Т.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ВерсияСпецификации);
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	// Проверка на проведение
	Выборка = РезультатЗапроса[0].Выбрать();
	Если Не Выборка.Следующий() Тогда
		ВызватьИсключение НСтр("ru = 'Версия спецификации не проведена'");
	КонецЕсли;
	// Основная версия, дополняющая версия, исправления версии
	Версия = Новый Структура;
	Версия.Вставить("Основная", Выборка.ОсновнаяВерсия);
	Версия.Вставить("Дополняющая", Выборка.ДополняющаяВерсия);
	Версия.Вставить("Исправления", Выборка.ВерсияИсправления);
	Версия.Вставить("Представление", СтрШаблон("%1.%2.%3",
		XMLСтрока(Версия.Основная), XMLСтрока(Версия.Дополняющая), XMLСтрока(Версия.Исправления)));
	// Автор версии
	Автор = Новый Структура;
	Автор.Вставить("ФИО", Выборка.АвторПредставление);
	ПользовательИБ = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
		Пользователи.СвойстваПроверяемогоПользователяИБ(Выборка.Автор), "ПользовательИБ");
	Автор.Вставить("ЭлПочта", ?(ПользовательИБ = Неопределено, "", ПользовательИБ.АдресЭлектроннойПочты));
	Автор.Вставить("ДатаМодификации", Выборка.Дата);
	// ИсторияДанных
	История = Новый Структура;
	История.Вставить("Спецификация", Новый Структура);
	История.Вставить("ТипыДанных", Новый Соответствие);
	История.Вставить("Перечисления", Новый Соответствие);
	История.Вставить("Каналы", Новый Соответствие);
	История.Вставить("Примеры", Новый Соответствие);
	Выборка = РезультатЗапроса[1].Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ДанныеВерсии = ИсторияДанных.ПолучитьДанныеВерсии(Выборка.Объект, Выборка.НомерВерсии);
		Если ДанныеВерсии = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ТОбъект = ТипЗнч(Выборка.Объект);
		Если ТОбъект = Тип("СправочникСсылка.кфкСпецификации") Тогда
			Данные = Новый Структура(ДанныеВерсии);
			Данные.Вставить("Ссылка", Выборка.Объект);
			История.Спецификация = Новый ФиксированнаяСтруктура(Данные);
			Продолжить;
			
		ИначеЕсли ТОбъект = Тип("СправочникСсылка.кфкТипыДанныхСпецификации") Тогда
			Коллекция = История.ТипыДанных;
			
		ИначеЕсли ТОбъект = Тип("СправочникСсылка.кфкПеречисленияСпецификации") Тогда
			Коллекция = История.Перечисления;
			
		ИначеЕсли ТОбъект = Тип("СправочникСсылка.кфкКаналыСпецификации") Тогда
			Коллекция = История.Каналы;
			
		ИначеЕсли ТОбъект = Тип("СправочникСсылка.кфкПримерыСообщенийСпецификации") Тогда
			Коллекция = История.Примеры;
			
		Иначе
			ВызватьИсключение НСтр("ru = 'Неизвестный тип объекта'");
		КонецЕсли;
		Коллекция.Вставить(Выборка.Объект, ДанныеВерсии);
		
	КонецЦикла;
	
	// ФОРМИРОВАНИЕ СПЕЦИФИКАЦИИ
	ДобавитьСтроку(ТДок, 0, "asyncapi", СтрокаYAML("3.1.0"));
	// Общие информация
	ВертикальныйОтступ(ТДок);
	ДобавитьСтроку(ТДок, 0, "info");
	ДобавитьСтроку(ТДок, 1, "title", ИсторияСпецификация(История).Наименование);
	ДобавитьСтроку(ТДок, 1, "version", СтрокаYAML(Версия.Представление));
	// Автор версии спецификации
	ВертикальныйОтступ(ТДок);
	ДобавитьСтроку(ТДок, 0, "x-last-modified");
	ДобавитьСтроку(ТДок, 1, "at", СтрокаYAML(XMLСтрока(Автор.ДатаМодификации)));
	ДобавитьСтроку(ТДок, 1, "name", Автор.ФИО);
	Если Не ПустаяСтрока(Автор.ЭлПочта) Тогда
		ДобавитьСтроку(ТДок, 1, "email", Автор.ЭлПочта);
	КонецЕсли;
	// Формат сообщений
	ВертикальныйОтступ(ТДок);
	ДобавитьСтроку(ТДок, 0, "defaultContentType", "application/json");
	
	ДобавитьКаналы(ТДок, История);
	ДобавитьОперация(ТДок, История);
	ДобавитьКомпоненты(ТДок, История);
	
	Поток = Новый ПотокВПамяти;
	ТДок.Записать(Поток);
	ДанныеФайла = Поток.ЗакрытьИПолучитьДвоичныеДанные();
	
	Результат = Новый Структура;
	Результат.Вставить("ИмяФайла", СтрШаблон("AsyncAPI-%1.yaml", Версия.Представление));
	Результат.Вставить("ДанныеФайла", ДанныеФайла);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СтрокаYAML(Значение, Уровень = 0)
	
	Если СтрЧислоВхождений(Значение, Символы.ПС) = 0 Тогда
		Возврат "'" + СтрЗаменить(Значение, "'", "''") + "'";
		
	Иначе
		Части = СтрРазделить(Значение, Символы.ПС, Ложь);
		Если Части.Количество() = 0 Тогда
			Возврат Значение;
		КонецЕсли;
		Отступ = СтроковыеФункцииКлиентСервер.СформироватьСтрокуСимволов(" ", (Уровень + 1) * 2);
		Для Индекс = 0 По Части.ВГраница() Цикл
			Части[Индекс] = Отступ + СокрЛП(Части[Индекс]);
		КонецЦикла;
		Части.Вставить(0, "|-");
		Возврат СтрСоединить(Части, Символы.ПС);
		
	КонецЕсли;
	
КонецФункции

Процедура ДобавитьСтроку(ТДок, Уровень, Ключ = Неопределено, Значение = Неопределено, ЭлементМассив = Ложь)
	
	Отступ = СтроковыеФункцииКлиентСервер.СформироватьСтрокуСимволов(" ", Уровень * 2);
	
	Если Ключ = Неопределено И Значение = Неопределено Тогда
		ТДок.ДобавитьСтроку("");
		
	ИначеЕсли Ключ <> Неопределено И Значение <> Неопределено Тогда
		ТДок.ДобавитьСтроку(Отступ
			+ ?(ЭлементМассив, "- ", "")
			+ Ключ + ":" + ?(ПустаяСтрока(Значение), "", " " + Значение));
		
	ИначеЕсли Ключ <> Неопределено И Значение = Неопределено Тогда
		ТДок.ДобавитьСтроку(Отступ + Ключ + ":");
		
	ИначеЕсли Ключ = Неопределено И Значение <> Неопределено Тогда
		ТДок.ДобавитьСтроку(Отступ + "- " + Значение);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ВертикальныйОтступ(ТДок)
	ТДок.ДобавитьСтроку("");
КонецПроцедуры

#Область ЗаполнениеСпецификации

Процедура ДобавитьКаналы(ТДок, История)
	
	Список = Новый СписокЗначений;
	Для Каждого Канал Из История.Каналы Цикл
		
		Если Канал.Значение.ПометкаУдаления Тогда
			Продолжить;
		КонецЕсли;
		
		ТипДанных = ИсторияТипДанных(История, Канал.Значение.ТипДанных);
		Список.Добавить(Канал.Ключ, ТипДанных.Код);
		
	КонецЦикла;
	Список.СортироватьПоПредставлению();
	
	Если Список.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Спецификация = ИсторияСпецификация(История);
	
//	channels:
//		testDocumentChanged:
//			address: 1c.test-document.changed
//			messages:
//				testDocumentChanged:
//					$ref: '#/components/messages/TestDocumentChangedMessage'

	ВертикальныйОтступ(ТДок);
	ДобавитьСтроку(ТДок, 0, "channels");
	
	Для Каждого Элемент Из Список Цикл
		
		Канал = ИсторияКанал(История, Элемент.Значение);
		ТипДанных = ИсторияТипДанных(История, Канал.ТипДанных);
		
		ШаблонТопика = Спецификация.АдресТопика;
		ШаблонКанала = ?(ПустаяСтрока(Канал.ИмяКанала), Спецификация.ИмяКанала, Канал.ИмяКанала);
		ШаблонСообщения = ?(ПустаяСтрока(Канал.ИмяСообщения), Спецификация.ИмяСообщения, Канал.ИмяСообщения);
		ШаблонСообщенияКанала = ?(ПустаяСтрока(Канал.ИмяСообщенияКанала), Спецификация.ИмяСообщенияКанала, Канал.ИмяСообщенияКанала);
		
		АдресТопика = ИмяПоШаблону(ШаблонТопика, ТипДанных.Код);
		ИмяКанала = ИмяПоШаблону(ШаблонКанала, ТипДанных.Код);
		ИмяСообщения = ИмяПоШаблону(ШаблонСообщения, ТипДанных.Код);
		ИмяСообщенияКанала = ИмяПоШаблону(ШаблонСообщенияКанала, ТипДанных.Код);
		
		СсылкаСообщения = СтрШаблон("#/components/messages/%1", ИмяСообщения);
		
		ДобавитьСтроку(ТДок, 1, ИмяКанала);
		ДобавитьСтроку(ТДок, 2, "title", Канал.Наименование);
		ДобавитьСтроку(ТДок, 2, "address", АдресТопика);
		ДобавитьСтроку(ТДок, 2, "messages");
		ДобавитьСтроку(ТДок, 3, ИмяСообщенияКанала);
		ДобавитьСтроку(ТДок, 4, "$ref", СтрокаYAML(СсылкаСообщения));
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьОперация(ТДок, История)
	
	Список = Новый СписокЗначений;
	Для Каждого Канал Из История.Каналы Цикл
		
		Если Канал.Значение.ПометкаУдаления Тогда
			Продолжить;
		КонецЕсли;
		
		ТипДанных = ИсторияТипДанных(История, Канал.Значение.ТипДанных);
		Список.Добавить(Канал.Ключ, ТипДанных.Код);
		
	КонецЦикла;
	Список.СортироватьПоПредставлению();
	
	Если Список.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Спецификация = ИсторияСпецификация(История);
	
//	operations:
//		sendTestDocumentChanged:
//			action: send
//			channel:
//				$ref: '#/channels/testDocumentChanged'
//			messages:
//				- $ref: '#/channels/testDocumentChanged/messages/testDocumentChanged'

	ВертикальныйОтступ(ТДок);
	ДобавитьСтроку(ТДок, 0, "operations");
	
	Для Каждого Элемент Из Список Цикл
		
		Канал = ИсторияКанал(История, Элемент.Значение);
		ТипДанных = ИсторияТипДанных(История, Канал.ТипДанных);
		Операция = ?(Спецификация.Владелец.Ссылка = Канал.Отправитель.Ссылка, "send", "receive");
		
		ШаблонКанала = ?(ПустаяСтрока(Канал.ИмяКанала), Спецификация.ИмяКанала, Канал.ИмяКанала);
		ШаблонОперации = ?(ПустаяСтрока(Канал.ИмяОперации), Спецификация.ИмяОперации, Канал.ИмяОперации);
		ШаблонСообщенияКанала = ?(ПустаяСтрока(Канал.ИмяСообщенияКанала), Спецификация.ИмяСообщенияКанала, Канал.ИмяСообщенияКанала);
		
		ИмяКанала = ИмяПоШаблону(ШаблонКанала, ТипДанных.Код);
		ИмяОперации = ИмяПоШаблону(ШаблонОперации, ТипДанных.Код, Операция);
		ИмяСообщенияКанала = ИмяПоШаблону(ШаблонСообщенияКанала, ТипДанных.Код);
		
		СсылкаКанала = СтрШаблон("#/channels/%1", ИмяКанала);
		СсылкаСообщенияКанала = СтрШаблон("%1/messages/%2", СсылкаКанала, ИмяСообщенияКанала);
		
		ДобавитьСтроку(ТДок, 1, ИмяОперации);
		ДобавитьСтроку(ТДок, 2, "action", Операция);
		ДобавитьСтроку(ТДок, 2, "channel");
		ДобавитьСтроку(ТДок, 3, "$ref", СтрокаYAML(СсылкаКанала));
		ДобавитьСтроку(ТДок, 2, "messages");
		ДобавитьСтроку(ТДок, 3, "$ref", СтрокаYAML(СсылкаСообщенияКанала), Истина);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьКомпоненты(ТДок, История)
	
	ВертикальныйОтступ(ТДок);
	ДобавитьСтроку(ТДок, 0, "components");
	
	ДобавитьКомпонентСообщения(ТДок, История);
	
	ТипыЗначений = ДоступныеТипыЗначений();
	ПодчинныеЭлементы = ПодчинныеЭлементыТиповДанных(ИсторияСпецификация(История).Ссылка);
	
	ДобавитьСтроку(ТДок, 1, "schemas");
	ДобавитьКомпонентТипыДанных(ТДок, История, 2, Справочники.кфкТипыДанныхСпецификации.ПустаяСсылка(),
		ТипыЗначений, ПодчинныеЭлементы);
	ДобавитьКомпонентПеречисления(ТДок, История, ТипыЗначений);
	
КонецПроцедуры

Процедура ДобавитьКомпонентСообщения(ТДок, История)
	
	Список = Новый СписокЗначений;
	Для Каждого Канал Из История.Каналы Цикл
		
		Если Канал.Значение.ПометкаУдаления Тогда
			Продолжить;
		КонецЕсли;
		
		ТипДанных = ИсторияТипДанных(История, Канал.Значение.ТипДанных);
		Список.Добавить(Канал.Ключ, ТипДанных.Код);
		
	КонецЦикла;
	Список.СортироватьПоПредставлению();
	
	Если Список.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Спецификация = ИсторияСпецификация(История);
	
//	components:
//		messages:
//			TestDocumentChangedMessage:
//				name: TestDocumentChangedMessage
//				payload:
//					$ref: '#/components/schemas/TestDocumentPayload'
	
	ДобавитьСтроку(ТДок, 1, "messages");
	
	Для Каждого Элемент Из Список Цикл
		
		Канал = ИсторияКанал(История, Элемент.Значение);
		ТипДанных = ИсторияТипДанных(История, Канал.ТипДанных);
		
		ШаблонСообщения = ?(ПустаяСтрока(Канал.ИмяСообщения), Спецификация.ИмяСообщения, Канал.ИмяСообщения);
		ШаблонСхемы = Спецификация.ИмяСхемы;
		
		ИмяСообщения = ИмяПоШаблону(ШаблонСообщения, ТипДанных.Код);
		ИмяСхемы = ИмяПоШаблону(ШаблонСхемы, ТипДанных.Код);
		
		СсылкаСхемы = СтрШаблон("#/components/schemas/%1", ИмяСхемы);
		
		ДобавитьСтроку(ТДок, 2, ИмяСообщения);
		ДобавитьСтроку(ТДок, 3, "name", ИмяСообщения);
		ДобавитьСтроку(ТДок, 3, "payload");
		ДобавитьСтроку(ТДок, 4, "$ref", СтрокаYAML(СсылкаСхемы));
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьКомпонентТипыДанных(ТДок, История, Уровень, Родитель, ТипыЗначений, ПодчинныеЭлементы,
		ОбязательныеСвойстваРодителя = Неопределено)
	
	Список = Новый СписокЗначений;
	Для Каждого Элемент Из ПодчинныеЭлементы.Получить(Родитель) Цикл
		
		ТипДанных = ИсторияТипДанных(История, Элемент);
		Если ТипДанных = Неопределено Или ТипДанных.ПометкаУдаления Или ТипДанных.Родитель.Ссылка <> Родитель Тогда
			Продолжить;
		КонецЕсли;
		
		Порядок = "0";
		ТипЗначенияСсылка = ТипДанных.ТипДанных.Ссылка;
		Если ТипЗначенияСсылка = Справочники.кфкТипыЗначенийСпецификации.Строка
				Или ТипЗначенияСсылка = Справочники.кфкТипыЗначенийСпецификации.Число
				Или ТипЗначенияСсылка = Справочники.кфкТипыЗначенийСпецификации.ЦелоеЧисло
				Или ТипЗначенияСсылка = Справочники.кфкТипыЗначенийСпецификации.Логический Тогда
			Порядок = "01";
			
		ИначеЕсли ТипЗначенияСсылка = Справочники.кфкТипыЗначенийСпецификации.Структура Тогда
			Порядок = "02";
			
		ИначеЕсли ТипЗначенияСсылка = Справочники.кфкТипыЗначенийСпецификации.Массив Тогда
			Порядок = "03";
			
		КонецЕсли;
		
		Список.Добавить(Элемент, Порядок + "-" + ТипДанных.Код);
		
	КонецЦикла;
	Список.СортироватьПоПредставлению();
	
	Если Список.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Спецификация = ИсторияСпецификация(История);
	
//	components:
//		schemas:
//			TestDocumentPayload:
//				type: object
//				required:
//					- id
//				properties:
//					id:
//						type: string
//						format: uuid
//				operation:
//					$ref: '#/components/schemas/OperationKind'
//				quality:
//					$ref: '#/components/schemas/QualityKind'
	
	Для Каждого Элемент Из Список Цикл
		
		ТипДанных = ИсторияТипДанных(История, Элемент.Значение);
		ИмяТипа = ?(Родитель.Пустая(), ИмяПоШаблону(Спецификация.ИмяСхемы, ТипДанных.Код), ТипДанных.Код);
		
		ДобавитьСтроку(ТДок, Уровень, ИмяТипа);
		ДобавитьОписаниеТипаДанных(ТДок, История, Уровень, ТипДанных, Элемент.Значение, ТипыЗначений, ПодчинныеЭлементы);
		
		Если ОбязательныеСвойстваРодителя <> Неопределено И ТипДанных.Обязательное Тогда
			ОбязательныеСвойстваРодителя.Добавить(ИмяТипа);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьОписаниеТипаДанных(ТДок, История, Уровень, ТипДанных, ТипДанныхСсылка, ТипыЗначений, ПодчинныеЭлементы)
	
	ТипЗначенияСсылка = ТипДанных.ТипДанных.Ссылка;
	
	Если Не ПустаяСтрока(ТипДанных.Наименование) Тогда
		ДобавитьСтроку(ТДок, Уровень + 1, "title", ТипДанных.Наименование);
	КонецЕсли;
	Если Не ПустаяСтрока(ТипДанных.Описание) Тогда
		ДобавитьСтроку(ТДок, Уровень + 1, "description", СтрокаYAML(ТипДанных.Описание, Уровень + 1));
	КонецЕсли;
	Если ТипДанных.Устарело Тогда
		ДобавитьСтроку(ТДок, Уровень + 1, "deprecated", XMLСтрока(ТипДанных.Устарело));
	КонецЕсли;
	Если Не ТипДанных.Перечисление.Ссылка.Пустая() Тогда
		Перечисление = ИсторияПеречисление(История, ТипДанных.Перечисление.Ссылка);
		СсылкаПеречисления = СтрШаблон("#/components/schemas/%1", Перечисление.Наименование);
		ДобавитьСтроку(ТДок, Уровень + 1, "$ref", СтрокаYAML(СсылкаПеречисления));
		
	ИначеЕсли ТипДанных.БазовыеТипы.Количество() = 1 И ПодчинныеЭлементы.Получить(ТипДанныхСсылка).Количество() = 0 Тогда
		БазовыйТип = ИсторияТипДанных(История, ТипДанных.БазовыеТипы[0].Тип.Ссылка);
		ИмяБазовогоТипа = ИмяПоШаблону(ИсторияСпецификация(История).ИмяСхемы, БазовыйТип.Код);
		СсылкаБазовыйТип = СтрШаблон("#/components/schemas/%1", ИмяБазовогоТипа);
		ДобавитьСтроку(ТДок, Уровень + 1, "$ref", СтрокаYAML(СсылкаБазовыйТип));
		
	Иначе
		СмещениеУровня = 0;
		Если ТипДанных.БазовыеТипы.Количество() > 1 Тогда
			ДобавитьСтроку(ТДок, Уровень + 1, "allOf");
			Для Каждого Строка Из ТипДанных.БазовыеТипы Цикл
				БазовыйТип = ИсторияТипДанных(История, Строка.Тип.Ссылка);
				ИмяБазовогоТипа = ИмяПоШаблону(ИсторияСпецификация(История).ИмяСхемы, БазовыйТип.Код);
				СсылкаБазовыйТип = СтрШаблон("#/components/schemas/%1", ИмяБазовогоТипа);
				ДобавитьСтроку(ТДок, Уровень + 2, "$ref", СтрокаYAML(СсылкаБазовыйТип), Истина);
			КонецЦикла;
			СмещениеУровня = 1;
		КонецЕсли;
		ДобавитьСтроку(ТДок, Уровень + СмещениеУровня + 1, "type", ТипыЗначений.Получить(ТипЗначенияСсылка));
		Если Не ТипДанных.ФорматДанных.Ссылка.Пустая() Тогда
			ДобавитьСтроку(ТДок, Уровень + СмещениеУровня + 1, "format", ТипыЗначений.Получить(ТипДанных.ФорматДанных.Ссылка));
		КонецЕсли;
		Если ТипЗначенияСсылка = Справочники.кфкТипыЗначенийСпецификации.Структура Тогда
			ДобавитьСтроку(ТДок, Уровень + СмещениеУровня + 1, "properties");
			ОбязательныеСвойства = Новый Массив;
			ДобавитьКомпонентТипыДанных(ТДок, История, Уровень + СмещениеУровня + 2, ТипДанныхСсылка,
				ТипыЗначений, ПодчинныеЭлементы, ОбязательныеСвойства);
			Если ОбязательныеСвойства.Количество() > 0 Тогда
				ДобавитьСтроку(ТДок, Уровень + СмещениеУровня + 1, "required");
				Для Каждого Элемент Из ОбязательныеСвойства Цикл
					ДобавитьСтроку(ТДок, Уровень + СмещениеУровня + 2, , Элемент);
				КонецЦикла;
			КонецЕсли;
			
		ИначеЕсли ТипЗначенияСсылка = Справочники.кфкТипыЗначенийСпецификации.Массив Тогда
			Если ТипДанных.Минимум <> -1 Тогда
				ДобавитьСтроку(ТДок, Уровень + СмещениеУровня + 1, "minItems", XMLСтрока(ТипДанных.Минимум));
			КонецЕсли;
			Если ТипДанных.Максимум <> -1 Тогда
				ДобавитьСтроку(ТДок, Уровень + СмещениеУровня + 1, "maxItems", XMLСтрока(ТипДанных.Максимум));
			КонецЕсли;
			ДобавитьСтроку(ТДок, Уровень + СмещениеУровня + 1, "items");
			ЭлементМассиваСсылка = ПодчинныеЭлементы.Получить(ТипДанныхСсылка)[0];
			ЭлементМассива = ИсторияТипДанных(История, ЭлементМассиваСсылка);
			ДобавитьОписаниеТипаДанных(ТДок, История, Уровень + СмещениеУровня + 2, ЭлементМассива, ЭлементМассиваСсылка,
				ТипыЗначений, ПодчинныеЭлементы);
			
		ИначеЕсли ТипЗначенияСсылка = Справочники.кфкТипыЗначенийСпецификации.Строка Тогда
			Если ТипДанных.Минимум <> -1 Тогда
				ДобавитьСтроку(ТДок, Уровень + СмещениеУровня + 1, "minLength", XMLСтрока(ТипДанных.Минимум));
			КонецЕсли;
			Если ТипДанных.Максимум <> -1 Тогда
				ДобавитьСтроку(ТДок, Уровень + СмещениеУровня + 1, "maxLength", XMLСтрока(ТипДанных.Максимум));
			КонецЕсли;
			Если Не ПустаяСтрока(ТипДанных.РегулярноеВыражение) Тогда
				ДобавитьСтроку(ТДок, Уровень + СмещениеУровня + 1, "pattern", ТипДанных.РегулярноеВыражение);
			КонецЕсли;
			Если ЗначениеЗаполнено(ТипДанных.ЗначениеПоУмолчанию) Тогда
				ДобавитьСтроку(ТДок, Уровень + 1, "default", XMLСтрока(ТипДанных.ЗначениеПоУмолчанию));
			КонецЕсли;
			
		ИначеЕсли ТипЗначенияСсылка = Справочники.кфкТипыЗначенийСпецификации.Число Тогда
			Если ТипДанных.Минимум <> -1 Тогда
				ДобавитьСтроку(ТДок, Уровень + СмещениеУровня + 1, "minimum", XMLСтрока(ТипДанных.Минимум));
			КонецЕсли;
			Если ТипДанных.Максимум <> -1 Тогда
				ДобавитьСтроку(ТДок, Уровень + СмещениеУровня + 1, "maximum", XMLСтрока(ТипДанных.Максимум));
			КонецЕсли;
			Если ЗначениеЗаполнено(ТипДанных.ЗначениеПоУмолчанию) Тогда
				ДобавитьСтроку(ТДок, Уровень + 1, "default", XMLСтрока(ТипДанных.ЗначениеПоУмолчанию));
			КонецЕсли;
			
		ИначеЕсли ТипЗначенияСсылка = Справочники.кфкТипыЗначенийСпецификации.ЦелоеЧисло
				Или ТипЗначенияСсылка = Справочники.кфкТипыЗначенийСпецификации.Логический Тогда
			Если ЗначениеЗаполнено(ТипДанных.ЗначениеПоУмолчанию) Тогда
				ДобавитьСтроку(ТДок, Уровень + 1, "default", XMLСтрока(ТипДанных.ЗначениеПоУмолчанию));
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
//	examples XXX: добавить
	
КонецПроцедуры

Процедура ДобавитьКомпонентПеречисления(ТДок, История, ТипыЗначений)
	
	Список = Новый СписокЗначений;
	Для Каждого Перечисление Из История.Перечисления Цикл
		
		Если Перечисление.Значение.ПометкаУдаления Тогда
			Продолжить;
		КонецЕсли;
		
		Список.Добавить(Перечисление.Ключ, Перечисление.Значение.Код);
		
	КонецЦикла;
	Список.СортироватьПоПредставлению();
	
	Если Список.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
//	components:
//		schemas:
//			OperationKind:
//				type: string
//				enum:
//					- Create
//					- Update
//					- Delete
//			QualityKind:
//				type: integer
//				enum:
//					- 0
//					- 1
//					- 2
//				x-enumNames:
//					- Не определено
//					- Хорошее
//					- Плохое
	
	Для Каждого Элемент Из Список Цикл
		
		Перечисление = ИсторияПеречисление(История, Элемент.Значение);
		
		ДобавитьСтроку(ТДок, 2, Перечисление.Наименование);
		ДобавитьСтроку(ТДок, 3, "type", ТипыЗначений.Получить(Перечисление.ТипЗначения.Ссылка));
		ДобавитьСтроку(ТДок, 3, "enum");
		Для Каждого Значение Из Перечисление.Значения Цикл
			ДобавитьСтроку(ТДок, 4, , Значение.Значение);
		КонецЦикла;
		Если Перечисление.Значения.Количество() > 0 И Не ПустаяСтрока(Перечисление.Значения[0].Представление) Тогда
			ДобавитьСтроку(ТДок, 3, "x-enumNames");
			Для Каждого Значение Из Перечисление.Значения Цикл
				ДобавитьСтроку(ТДок, 4, , Значение.Представление);
			КонецЦикла;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Доступные типы значений спецификации
// 
// Возвращаемое значение:
//	Соответствие Из КлючИЗначение - Доступные типы значений:
//		* Ключ - СправочникСсылка.кфкТипыЗначенийСпецификации - Тип значения
//		* Значение - Строка - Код типа значения
Функция ДоступныеТипыЗначений()
	
	Результат = Новый Соответствие;
	
	Выборка = Справочники.кфкТипыЗначенийСпецификации.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Результат.Вставить(Выборка.Ссылка, Выборка.Код);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Возвращает подчиненные элементы типов данных
// 
// Параметры:
//	Спецификация - СправочникСсылка.кфкСпецификации - Спецификация
// 
// Возвращаемое значение:
//	Соответствие Из КлючИЗначение - Подчинные элементы:
//		* Ключ - СправочникСсылка.кфкТипыДанныхСпецификации - Родитель
//		* Значение - Массив Из СправочникСсылка.кфкТипыДанныхСпецификации - Подчиненные элементы
Функция ПодчинныеЭлементыТиповДанных(Спецификация)
	
	Результат = Новый Соответствие;
	
	Выборка = Справочники.кфкТипыДанныхСпецификации.Выбрать(, Спецификация);
	Пока Выборка.Следующий() Цикл
		
		Элементы = Результат.Получить(Выборка.Родитель);
		Если Элементы = Неопределено Тогда
			Элементы = Новый Массив;
			Результат.Вставить(Выборка.Родитель, Элементы);
		КонецЕсли;
		
		Элементы.Добавить(Выборка.Ссылка);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ИсторияДанных

// Возвращает спецификацию из истории данных
// 
// Параметры:
//	История - Структура - История данных
// 
// Возвращаемое значение:
//	СправочникОбъект.кфкСпецификации, ФиксированнаяСтруктура - Спецификация
Функция ИсторияСпецификация(История)
	Возврат История.Спецификация;
КонецФункции

// Возвращает канал из истории данных
// 
// Параметры:
//	История - Структура - История данных
//	Ссылка - СправочникСсылка.кфкКаналыСпецификации - Ссылка
// 
// Возвращаемое значение:
//	СправочникОбъект.кфкКаналыСпецификации, ФиксированнаяСтруктура - Канал
Функция ИсторияКанал(История, Ссылка)
	Возврат История.Каналы.Получить(?(ТипЗнч(Ссылка) = Тип("ФиксированнаяСтруктура"), Ссылка.Ссылка, Ссылка));
КонецФункции

// Возвращает тип данных из истории данных
// 
// Параметры:
//	История - Структура - История данных
//	Ссылка - СправочникСсылка.кфкТипыДанныхСпецификации - Ссылка
// 
// Возвращаемое значение:
//	СправочникОбъект.кфкТипыДанныхСпецификации, ФиксированнаяСтруктура - Тип данных
Функция ИсторияТипДанных(История, Ссылка)
	Возврат История.ТипыДанных.Получить(?(ТипЗнч(Ссылка) = Тип("ФиксированнаяСтруктура"), Ссылка.Ссылка, Ссылка));
КонецФункции

// Возвращает перечисление из истории данных
// 
// Параметры:
//	История - Структура - История данных
//	Ссылка - СправочникСсылка.кфкПеречисленияСпецификации - Ссылка
// 
// Возвращаемое значение:
//	СправочникОбъект.кфкПеречисленияСпецификации, ФиксированнаяСтруктура - Перечисление
Функция ИсторияПеречисление(История, Ссылка)
	Возврат История.Перечисления.Получить(?(ТипЗнч(Ссылка) = Тип("ФиксированнаяСтруктура"), Ссылка.Ссылка, Ссылка));
КонецФункции

// Возвращает пример из истории данных
// 
// Параметры:
//	История - Структура - История данных
//	Ссылка - СправочникСсылка.кфкПримерыСообщенийСпецификации - Ссылка
// 
// Возвращаемое значение:
//	СправочникОбъект.кфкПримерыСообщенийСпецификации, ФиксированнаяСтруктура - Пример
Функция ИсторияПример(История, Ссылка)
	Возврат История.Примеры.Получить(?(ТипЗнч(Ссылка) = Тип("ФиксированнаяСтруктура"), Ссылка.Ссылка, Ссылка));
КонецФункции

#КонецОбласти

#Область ШаблоныИмен

// Возвращает сформированное имя по шаблону
//
// Параметры:
//	ИсходныйШаблон - Строка - Шаблон с тегами %ТИП% и %ОПЕРАЦИЯ%.
//	ИмяТипа - Строка - Имя типа данных.
//	Операция - Булево - Действие системы-владельца: send или receive.
//
// Возвращаемое значение:
//	Строка - Сформированное имя.
Функция ИмяПоШаблону(Знач ИсходныйШаблон, Знач ИмяТипа, Знач Операция = "")
	
	Если ПустаяСтрока(ИсходныйШаблон) Тогда
		ВызватьИсключение НСтр("ru = 'Не задан шаблон имени.'");
	КонецЕсли;
	
	Если ПустаяСтрока(ИмяТипа) Тогда
		ВызватьИсключение НСтр("ru = 'Не задано имя типа данных.'");
	КонецЕсли;
	
	ЧастиШаблона = РазложитьШаблон(ИсходныйШаблон);
	ЧастиТипа = РазложитьИмяТипаВМассивСлов(ИмяТипа);
	
	Результат = Новый Массив;
	
	Для Каждого Шаблон Из ЧастиШаблона Цикл
		
		ТШаблон = ТипЗнч(Шаблон);
		Если ТШаблон = Тип("Строка") Тогда
			Результат.Добавить(Шаблон);
			
		ИначеЕсли ТШаблон = Тип("Структура") Тогда
			Значение = "";
			Если НРег(Шаблон.Ключ) = "тип" Тогда
				Значение = Новый Массив;
				РегистрСлова = Шаблон.РегистрПервогоСлова;
				Для Каждого Часть Из ЧастиТипа Цикл
					Значение.Добавить(СтрФормат(Часть, РегистрСлова));
					РегистрСлова = Шаблон.РегистрСледующихСлов;
				КонецЦикла;
				Результат.Добавить(СтрСоединить(Значение, Шаблон.Разделитель));
				
			ИначеЕсли НРег(Шаблон.Ключ) = "операция" Тогда
				Результат.Добавить(?(ПустаяСтрока(Шаблон.РегистрПервогоСлова), Операция,
					СтрФормат(Операция, Шаблон.РегистрПервогоСлова)));
				
			КонецЕсли;
			
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат СтрСоединить(Результат);
	
КонецФункции

// Возвращает массив частей шаблона
// 
// Параметры:
//	ИсходныйШаблон - Строка - Исходный шаблон
// 
// Возвращаемое значение:
//	Массив Из Строка, Структура - Части шаблона:
//		* Ключ - Строка - Имя тега
//		* РегистрПервогоСлова - Строка - Регистр первого слова
//		* Разделитель - Строка - Разделитель
//		* РегистрСледующихСлов - Строка - Регистр следующих слов
Функция РазложитьШаблон(Знач ИсходныйШаблон)
	
	Результат = Новый Массив;
	
	Вхождения = СтрНайтиВсеПоРегулярномуВыражению(ИсходныйШаблон, "%(ТИП|ОПЕРАЦИЯ)(:(аа)([-_.]?)(аа)?)?%", Истина);
	Если Вхождения.Количество() = 0 Тогда
		Результат.Добавить(ИсходныйШаблон);
		Возврат Результат;
	КонецЕсли;
	
	ТекущаяПозиция = 1;
	
	Для Каждого Вхождение Из Вхождения Цикл
		
		ДлинаЗначения = Вхождение.НачальнаяПозиция - ТекущаяПозиция;
		
		Если ДлинаЗначения > 0 Тогда
			Результат.Добавить(Сред(ИсходныйШаблон, ТекущаяПозиция, ДлинаЗначения));
		КонецЕсли;
		
		Группы = Вхождение.ПолучитьГруппы();
		
		Выражение = Новый Структура;
		Выражение.Вставить("Ключ", Группы[0].Значение);
		Если Не (Группы[1] = Неопределено Или ПустаяСтрока(Группы[1].Значение)) Тогда
			Выражение.Вставить("РегистрПервогоСлова", Группы[2].Значение);
			Выражение.Вставить("Разделитель", Группы[3].Значение);
			Выражение.Вставить("РегистрСледующихСлов", Группы[4].Значение);
		КонецЕсли;
		Результат.Добавить(Выражение);
		
		ТекущаяПозиция = Вхождение.НачальнаяПозиция + Вхождение.Длина;
		
	КонецЦикла;
	
	// Добавляем текст после последнего тега.
	Если ТекущаяПозиция <= СтрДлина(ИсходныйШаблон) Тогда
		Результат.Добавить(Сред(ИсходныйШаблон, ТекущаяПозиция));
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Разделяет имя типа данных на слова.
//
// Параметры:
//	ИмяТипа - Строка - Имя типа данных.
//
// Возвращаемое значение:
//	Массив из Строка - Слова имени типа данных.
//
Функция РазложитьИмяТипаВМассивСлов(Знач ИмяТипа)
	
	Результат = Новый Массив;
	
	Если ПустаяСтрока(ИмяТипа) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Слово = "";
	ДлинаИмени = СтрДлина(ИмяТипа);
	
	Для Позиция = 1 По ДлинаИмени Цикл
		
		Символ = Сред(ИмяТипа, Позиция, 1);
		
		Если СтрНайти("-_ .", Символ) > 0 Тогда
			
			Если Не ПустаяСтрока(Слово) Тогда
				Результат.Добавить(Слово);
				Слово = "";
			КонецЕсли;
			
			Продолжить;
			
		КонецЕсли;
		
		НачалоНовогоСлова = Ложь;
		
		Если Не ПустаяСтрока(Слово) Тогда
			
			ПредыдущийСимвол = Сред(ИмяТипа, Позиция - 1, 1);
			
			ТекущаяПрописная = Символ = ВРег(Символ)
				И Символ <> НРег(Символ);
			
			ПредыдущаяСтрочная = ПредыдущийСимвол = НРег(ПредыдущийСимвол)
				И ПредыдущийСимвол <> ВРег(ПредыдущийСимвол);
			
			НачалоНовогоСлова = ТекущаяПрописная
				И ПредыдущаяСтрочная;
			
			Если Не НачалоНовогоСлова
				И ТекущаяПрописная
				И Позиция < ДлинаИмени Тогда
				
				СледующийСимвол = Сред(ИмяТипа, Позиция + 1, 1);
				
				ПредыдущаяПрописная = ПредыдущийСимвол = ВРег(ПредыдущийСимвол)
					И ПредыдущийСимвол <> НРег(ПредыдущийСимвол);
				
				СледующаяСтрочная = СледующийСимвол = НРег(СледующийСимвол)
					И СледующийСимвол <> ВРег(СледующийСимвол);
				
				НачалоНовогоСлова = ПредыдущаяПрописная
					И СледующаяСтрочная;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если НачалоНовогоСлова Тогда
			Результат.Добавить(Слово);
			Слово = "";
		КонецЕсли;
		
		Слово = Слово + Символ;
		
	КонецЦикла;
	
	Если Не ПустаяСтрока(Слово) Тогда
		Результат.Добавить(Слово);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает строку преобразованную в указанный регистр слова
// 
// Параметры:
//	Значение - Строка - Значение
//	РегистрСлова - Строка - Регистр слова, доступные значения: АА, аа, Аа, аА
// 
// Возвращаемое значение:
//	Строка - Преобразованная строка
Функция СтрФормат(Значение, РегистрСлова)
	
	Если ПустаяСтрока(Значение) Тогда
		Возврат Значение;
		
	ИначеЕсли РегистрСлова = "АА" Тогда
		Возврат ВРег(Значение);
		
	ИначеЕсли РегистрСлова = "аа" Тогда
		Возврат НРег(Значение);
		
	ИначеЕсли РегистрСлова = "Аа" Тогда
		Возврат ТРег(Значение);
		
	ИначеЕсли РегистрСлова = "аА" Тогда
		Возврат НРег(Лев(Значение, 1)) + ВРег(Сред(Значение, 2));
		
	Иначе
		Возврат Значение;
		
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
